apache/nuttx/arch/arm/src/stm32/hardware/stm32f40xxx_pinmap_legacy.h
/* Quad SPI */

#if defined(CONFIG_STM32_STM32F446) || defined(CONFIG_STM32_STM32F469)
#  define GPIO_QUADSPI_BK1_IO0_1 (GPIO_ALT|GPIO_AF10|GPIO_PORTF|GPIO_PIN8)
#  define GPIO_QUADSPI_BK1_IO0_2 (GPIO_ALT|GPIO_AF9 |GPIO_PORTC|GPIO_PIN9)
#  define GPIO_QUADSPI_BK1_IO0_3 (GPIO_ALT|GPIO_AF9 |GPIO_PORTD|GPIO_PIN11)
#  define GPIO_QUADSPI_BK1_IO1_1 (GPIO_ALT|GPIO_AF10|GPIO_PORTF|GPIO_PIN9)
#  define GPIO_QUADSPI_BK1_IO1_2 (GPIO_ALT|GPIO_AF9 |GPIO_PORTC|GPIO_PIN10)
#  define GPIO_QUADSPI_BK1_IO1_3 (GPIO_ALT|GPIO_AF9 |GPIO_PORTD|GPIO_PIN12)
#  define GPIO_QUADSPI_BK1_IO2_1 (GPIO_ALT|GPIO_AF9 |GPIO_PORTE|GPIO_PIN2)
#  define GPIO_QUADSPI_BK1_IO2_2 (GPIO_ALT|GPIO_AF9 |GPIO_PORTF|GPIO_PIN7)
#  define GPIO_QUADSPI_BK1_IO3_1 (GPIO_ALT|GPIO_AF9 |GPIO_PORTA|GPIO_PIN1)
#  define GPIO_QUADSPI_BK1_IO3_2 (GPIO_ALT|GPIO_AF9 |GPIO_PORTD|GPIO_PIN13)
#  define GPIO_QUADSPI_BK1_IO3_3 (GPIO_ALT|GPIO_AF9 |GPIO_PORTF|GPIO_PIN6)
#  define GPIO_QUADSPI_BK1_NCS_1 (GPIO_ALT|GPIO_AF10|GPIO_PORTB|GPIO_PIN6)
#endif
#if defined(CONFIG_STM32_STM32F446)
#  define GPIO_QUADSPI_BK1_NCS_2 (GPIO_ALT|GPIO_AF10|GPIO_PORTG|GPIO_PIN6)
#elif defined(CONFIG_STM32_STM32F469)
#  define GPIO_QUADSPI_BK1_NCS_3 (GPIO_ALT|GPIO_AF10|GPIO_PORTB|GPIO_PIN10)
#endif

#if defined(CONFIG_STM32_STM32F446) || defined(CONFIG_STM32_STM32F469)
#  define GPIO_QUADSPI_BK2_IO0_1 (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN7)
#  define GPIO_QUADSPI_BK2_IO1_1 (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN8)
#  define GPIO_QUADSPI_BK2_IO2_1 (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN9)
#  define GPIO_QUADSPI_BK2_IO2_2 (GPIO_ALT|GPIO_AF9 |GPIO_PORTG|GPIO_PIN9)
#  define GPIO_QUADSPI_BK2_IO3_1 (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN10)
#  define GPIO_QUADSPI_BK2_IO3_2 (GPIO_ALT|GPIO_AF9 |GPIO_PORTG|GPIO_PIN14)
#  define GPIO_QUADSPI_BK2_NCS   (GPIO_ALT|GPIO_AF9 |GPIO_PORTC|GPIO_PIN11)
#endif
#if defined(CONFIG_STM32_STM32F469)
#  define GPIO_QUADSPI_BK2_IO0_2 (GPIO_ALT|GPIO_AF9 |GPIO_PORTH|GPIO_PIN2)
#  define GPIO_QUADSPI_BK2_IO1_2 (GPIO_ALT|GPIO_AF9 |GPIO_PORTH|GPIO_PIN3)
#endif

/* SPDIFRX */

#if defined(CONFIG_STM32_STM32F446)
#  define GPIO_SPDIFRX_IN0_1  (GPIO_ALT|GPIO_AF7|GPIO_PORTG|GPIO_PIN11)
#  define GPIO_SPDIFRX_IN0_2  (GPIO_ALT|GPIO_AF8|GPIO_PORTD|GPIO_PIN7)
#  define GPIO_SPDIFRX_IN0_3  (GPIO_ALT|GPIO_AF8|GPIO_PORTB|GPIO_PIN7)
#  define GPIO_SPDIFRX_IN1_1  (GPIO_ALT|GPIO_AF7|GPIO_PORTG|GPIO_PIN12)
#  define GPIO_SPDIFRX_IN1_2  (GPIO_ALT|GPIO_AF8|GPIO_PORTD|GPIO_PIN8)
#  define GPIO_SPDIFRX_IN1_3  (GPIO_ALT|GPIO_AF7|GPIO_PORTC|GPIO_PIN7)
#  define GPIO_SPDIFRX_IN2_1  (GPIO_ALT|GPIO_AF7|GPIO_PORTG|GPIO_PIN8)
#  define GPIO_SPDIFRX_IN2_2  (GPIO_ALT|GPIO_AF8|GPIO_PORTC|GPIO_PIN4)
#  define GPIO_SPDIFRX_IN3_1  (GPIO_ALT|GPIO_AF7|GPIO_PORTG|GPIO_PIN9)
#  define GPIO_SPDIFRX_IN3_2  (GPIO_ALT|GPIO_AF8|GPIO_PORTC|GPIO_PIN5)
#endif

/* Serial Audio Interface */

#if defined(CONFIG_STM32_STM32F446)
#  define GPIO_SAI1_FS_A_1    (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN4)
#  define GPIO_SAI1_FS_A_2    (GPIO_ALT|GPIO_AF6|GPIO_PORTA|GPIO_PIN3)
#  define GPIO_SAI1_FS_B_1    (GPIO_ALT|GPIO_AF6|GPIO_PORTF|GPIO_PIN9)
#  define GPIO_SAI1_FS_B_2    (GPIO_ALT|GPIO_AF6|GPIO_PORTB|GPIO_PIN9)
#  define GPIO_SAI1_MCLK_A    (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN2)
#  define GPIO_SAI1_MCLK_B_1  (GPIO_ALT|GPIO_AF6|GPIO_PORTF|GPIO_PIN7)
#  define GPIO_SAI1_MCLK_B_2  (GPIO_ALT|GPIO_AF6|GPIO_PORTC|GPIO_PIN0)
#  define GPIO_SAI1_SCK_A_1   (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN5)
#  define GPIO_SAI1_SCK_A_2   (GPIO_ALT|GPIO_AF6|GPIO_PORTB|GPIO_PIN10)
#  define GPIO_SAI1_SCK_B_1   (GPIO_ALT|GPIO_AF6|GPIO_PORTF|GPIO_PIN8)
#  define GPIO_SAI1_SCK_B_2   (GPIO_ALT|GPIO_AF6|GPIO_PORTB|GPIO_PIN12)
#  define GPIO_SAI1_SD_A_1    (GPIO_ALT|GPIO_AF6|GPIO_PORTB|GPIO_PIN2)
#  define GPIO_SAI1_SD_B_1    (GPIO_ALT|GPIO_AF6|GPIO_PORTA|GPIO_PIN9)
#elif defined(CONFIG_STM32_STM32F469)
#  define GPIO_SAI1_FS_A      (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN4)
#  define GPIO_SAI1_FS_B      (GPIO_ALT|GPIO_AF6|GPIO_PORTF|GPIO_PIN9)
#  define GPIO_SAI1_MCLK_A_1  (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN2)
#  define GPIO_SAI1_MCLK_A_2  (GPIO_ALT|GPIO_AF6|GPIO_PORTG|GPIO_PIN7)
#  define GPIO_SAI1_MCLK_B    (GPIO_ALT|GPIO_AF6|GPIO_PORTF|GPIO_PIN7)
#  define GPIO_SAI1_SCK_A     (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN5)
#  define GPIO_SAI1_SCK_B     (GPIO_ALT|GPIO_AF6|GPIO_PORTF|GPIO_PIN8)
#endif

#if defined(CONFIG_STM32_STM32F446) || defined(CONFIG_STM32_STM32F469)
#  define GPIO_SAI1_SD_A_2    (GPIO_ALT|GPIO_AF6|GPIO_PORTC|GPIO_PIN1)
#  define GPIO_SAI1_SD_A_3    (GPIO_ALT|GPIO_AF6|GPIO_PORTD|GPIO_PIN6)
#  define GPIO_SAI1_SD_A_4    (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN6)
#  define GPIO_SAI1_SD_B_2    (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN3)
#  define GPIO_SAI1_SD_B_3    (GPIO_ALT|GPIO_AF6|GPIO_PORTF|GPIO_PIN6)
#endif

#if defined(CONFIG_STM32_STM32F446)
#  define GPIO_SAI2_FS_A_1    (GPIO_ALT|GPIO_AF10|GPIO_PORTD|GPIO_PIN12)
#  define GPIO_SAI2_FS_B_1    (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN13)
#  define GPIO_SAI2_FS_B_2    (GPIO_ALT|GPIO_AF10|GPIO_PORTG|GPIO_PIN9)
#  define GPIO_SAI2_FS_B_3    (GPIO_ALT|GPIO_AF8|GPIO_PORTA|GPIO_PIN12)
#  define GPIO_SAI2_MCLK_A_1  (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN0)
#  define GPIO_SAI2_MCLK_B_1  (GPIO_ALT|GPIO_AF10|GPIO_PORTA|GPIO_PIN1)
#  define GPIO_SAI2_MCLK_B_2  (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN14)
#  define GPIO_SAI2_SCK_A_1   (GPIO_ALT|GPIO_AF10|GPIO_PORTD|GPIO_PIN13)
#  define GPIO_SAI2_SCK_A_2   (GPIO_ALT|GPIO_AF8|GPIO_PORTD|GPIO_PIN14)
#  define GPIO_SAI2_SCK_B_1   (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN12)
#  define GPIO_SAI2_SCK_B_2   (GPIO_ALT|GPIO_AF8|GPIO_PORTA|GPIO_PIN2)
#  define GPIO_SAI2_SD_A_1    (GPIO_ALT|GPIO_AF10|GPIO_PORTD|GPIO_PIN11)
#  define GPIO_SAI2_SD_A_2    (GPIO_ALT|GPIO_AF10|GPIO_PORTB|GPIO_PIN11)
#  define GPIO_SAI2_SD_B_1    (GPIO_ALT|GPIO_AF10|GPIO_PORTG|GPIO_PIN10)
#  define GPIO_SAI2_SD_B_2    (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN11)
#  define GPIO_SAI2_SD_B_3    (GPIO_ALT|GPIO_AF10|GPIO_PORTF|GPIO_PIN11)
#endif

/* HDMI-CEC Controller */

#if defined(CONFIG_STM32_STM32F446)
#  define GPIO_HDMICEC_1      (GPIO_ALT|GPIO_AF3|GPIO_PORTB|GPIO_PIN6)
#  define GPIO_HDMICEC_2      (GPIO_ALT|GPIO_AF4|GPIO_PORTA|GPIO_PIN15)
#endif

/* FMPI2C */

#if defined(CONFIG_STM32_STM32F446)
#  define GPIO_FMPI2C1_SCL_1  (GPIO_ALT|GPIO_AF4|GPIO_SPEED_50MHz|GPIO_OPENDRAIN|GPIO_PORTC|GPIO_PIN6)
#  define GPIO_FMPI2C1_SCL_2  (GPIO_ALT|GPIO_AF4|GPIO_SPEED_50MHz|GPIO_OPENDRAIN|GPIO_PORTD|GPIO_PIN12)
#  define GPIO_FMPI2C1_SCL_3  (GPIO_ALT|GPIO_AF4|GPIO_SPEED_50MHz|GPIO_OPENDRAIN|GPIO_PORTD|GPIO_PIN14)
#  define GPIO_FMPI2C1_SCL_4  (GPIO_ALT|GPIO_AF4|GPIO_SPEED_50MHz|GPIO_OPENDRAIN|GPIO_PORTF|GPIO_PIN14)

#  define GPIO_FMPI2C1_SDA_1  (GPIO_ALT|GPIO_AF4|GPIO_SPEED_50MHz|GPIO_OPENDRAIN|GPIO_PORTC|GPIO_PIN7)
#  define GPIO_FMPI2C1_SDA_2  (GPIO_ALT|GPIO_AF4|GPIO_SPEED_50MHz|GPIO_OPENDRAIN|GPIO_PORTD|GPIO_PIN13)
#  define GPIO_FMPI2C1_SDA_3  (GPIO_ALT|GPIO_AF4|GPIO_SPEED_50MHz|GPIO_OPENDRAIN|GPIO_PORTD|GPIO_PIN15)
#  define GPIO_FMPI2C1_SDA_4  (GPIO_ALT|GPIO_AF4|GPIO_SPEED_50MHz|GPIO_OPENDRAIN|GPIO_PORTF|GPIO_PIN15)

#  define GPIO_FMPI2C1_SMBA_1 (GPIO_ALT|GPIO_AF4|GPIO_SPEED_50MHz|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN11)
#  define GPIO_FMPI2C1_SMBA_2 (GPIO_ALT|GPIO_AF4|GPIO_SPEED_50MHz|GPIO_PUSHPULL|GPIO_PORTF|GPIO_PIN13)
#endif

#endif /* __ARCH_ARM_SRC_STM32_HARDWARE_STM32F40XXX_PINMAP_LEGACY_H */
